{
  "id": 59413,
  "featured_video": {
    "desktop_mp4": "",
    "desktop_full_mp4": "",
    "desktop_credits_mp4": "",
    "desktop_ogg": "",
    "desktop_full_ogg": "",
    "desktop_credits_ogg": "",
    "desktop_webm": "",
    "desktop_full_webm": "",
    "desktop_credits_webm": "",
    "mobile_mp4": "",
    "mobile_full_mp4": "",
    "mobile_credits_mp4": "",
    "mobile_ogg": "",
    "mobile_full_ogg": "",
    "mobile_credits_ogg": "",
    "mobile_webm": "",
    "mobile_full_webm": "",
    "mobile_credits_webm": "",
    "video_found": 0
  },
  "thumbnail": {
    "id": "60255",
    "title": "dornoch-castle-whisky-bar",
    "alt": "dornoch-castle-whisky-bar",
    "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/23144800/dornoch-castle-whisky-bar.jpg",
    "courtesy": "",
    "position": "center"
  },
  "thumbnail_url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/23144800/dornoch-castle-whisky-bar.jpg",
  "slug": "dornoch-castle-scotland-whisky",
  "uri": "http://trivago-magazine-work-sample-server.s3-website.eu-central-1.amazonaws.com/dornoch-castle-scotland-whisky/",
  "title": "Dornoch Castle: A Whisky Tasting at One of the World's Most Popular Hotel Bars",
  "card_title": "Whisky Tasting at Dornoch Castle in the Scottish Highlands",
  "show_publish_date": false,
  "date": "January 29th, 2019",
  "newsletter_popup": false,
  "newsletter_popup_header_image": false,
  "taxonomies": {
    "destinations": [
      {
        "name": "Europe",
        "uri": "/destination/international/europe",
        "slug": "europe",
        "term_id": 1384
      }
    ],
    "themes": [],
    "types": [
      {
        "name": "Nature",
        "uri": "/type/nature",
        "slug": "nature",
        "term_id": 1380
      }
    ],
    "tags": []
  },
  "exclusive": false,
  "excerpt": "Dornoch Castle has amassed a whisky collection unlike most any other in the world. trivago Magazine Editor, Joe Baur, signs up for their whisky tasting. Video below.",
  "content": [
    {
      "type": "intro_text",
      "text": "<p><p>The sunrise tries to cut through the Scottish sky, a patchwork of gray quilts with a cold mist leaking through. I look up to admire the view of the Dornoch Castle Hotel from the garden, a collection of neatly stacked gray stones that form a modest castle to match its humble village surroundings. Phil Thompson is leading me out to the distillery, a former village firehouse turned garage when the Thompson family took over the hotel in 2000. Large slabs of misshapen stone cemented together around vivid red-painted doors give the distillery a quaint, rural Scottish feel. Dressed in a warm, zip-up pullover and a blue beanie, Phil shuffles through the crisp November morning air and escorts me through the side door.</p></p><p><p>Inside, an enlarged chemistry set is revealed. Pipes and hoses of various color and size connect to steel tanks and something like an elongated copper Chemex. A quiet stream of water flows down a maroon-colored chute into one of the tanks. That water, the same that gives life to these hushed hillsides and timeless towns throughout the Scottish Highlands, is the fundamental ingredient of a drink lionized throughout the world.</p></p><p><p>Combined with malted barley and yeast, it becomes <em>aquae vitae</em>. The ‘water of life’ or Scotch whisky &#8212; and the brothers Simon and Phil Thompson have amassed a tribute to this amber elixir in the form of a bar at the Dornoch Castle hotel illuminated by 400-plus bottles of spirit. Rare antiques that would go for double the price per dram (whisky vocab for ‘drink’) in the cosmopolitan bars of London or <a href=\"https://magazine.trivago.com/coolest-hotels-in-new-york-city/\" target=\"_blank\" rel=\"noopener\">New York City</a> lure drinkers from all corners of the globe. Even a novice can appreciate this collection even if only for the labels covered in old red cursive script, some peeling off after decades of changing hands.</p></p>"
    },
    {
      "type": "excerpt_in_article",
      "text": "<p>Dornoch Castle has amassed a whisky collection unlike most any other in the world. trivago Magazine Editor, Joe Baur, signs up for their whisky tasting. Video below.</p>"
    },
    {
      "type": "embed_video",
      "content": "<div class=\"iframe-container\"><iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/nZcsmcq5vW8?feature=oembed&controls=1&hd=1&autohide=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen frameborder=\"0\"></iframe></div>",
      "credits": ""
    },
    {
      "type": "text_module",
      "title": "Whisky Tasting at Dornoch Castle",
      "text": "<p>What is it about Scotch whisky that commands such devotion like a preacher commanding the soul of their flock? Most casual drinkers associate it with a bad night in college, the precursor to an evening &#8212; and an early morning &#8212; of regrettable decisions.</p><p>To better understand, I took my novice palate and scarce knowledge to <a href=\"https://www.trivago.com/dornoch-41772/hotel/dornoch-castle-1758325\" target=\"_blank\" rel=\"noopener\"><strong>Dornoch Castle</strong></a> to sign up for their whisky tasting so that I might learn the differences from a smokey Islay and a sweet Speyside, or indeed, what they are in the first place. But before I got to that, I had to learn how to properly taste the drink for maximum appreciation using one of the world’s top-rated whisky bars (rated by drinkers themselves) as my textbook.</p>",
      "blocks": [
        {
          "type": "travel_tips_box",
          "title": "Sign up for your own tasting at Dornoch Castle",
          "tips": [
            {
              "icon": "trivago-icon-icn_thumb_up_line_dark",
              "title": "Costs and Other Information",
              "description": "<p>Group tastings start at £40 per head and increase depending on the rarity of bottles the guests want to try.  Informal tastings can be held at the bar if time allows, but it's always best to pre-book. Besides the bar, tastings are also held either in front of the fireplace or in the town's former prison turned 'Vault' cellar.</p>"
            }
          ]
        },
        {
          "type": "related_articles",
          "title": "Get more Scottish travel ideas",
          "posts": [
            {
              "title": "5 Hotels in the Scottish Highlands: Unique Stays in the Great Outdoors",
              "card_title": "Hotels in the Scottish Highlands",
              "date": "January 24th, 2019",
              "slug": "hotels-in-the-scottish-highlands",
              "show_publish_date": false,
              "taxonomies": {
                "destinations": [
                  {
                    "name": "Europe"
                  }
                ]
              },
              "thumbnail_url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24095645/hotels-in-the-scottish-highlands-danka-peter-148722-unsplash.jpg"
            },
            {
              "title": "7 Hotels Near Edinburgh Castle: A City Break with a Medieval View",
              "card_title": "Hotels Near Edinburgh Castle for a Medieval City Break",
              "date": "January 24th, 2019",
              "slug": "hotels-near-edinburgh-castle",
              "show_publish_date": false,
              "taxonomies": {
                "destinations": [
                  {
                    "name": "Europe"
                  }
                ]
              },
              "thumbnail_url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24104650/hotels-near-edinburgh-castle-jorg-angeli-797072-unsplash.jpg"
            },
            {
              "title": "Whisky and History: The Scottish Heritage Trip to Reconnect with Your Roots",
              "card_title": "",
              "date": "November 16th, 2017",
              "slug": "scottish-heritage",
              "show_publish_date": true,
              "taxonomies": {
                "destinations": [
                  {
                    "name": "International"
                  }
                ]
              },
              "thumbnail_url": "https://media-magazine.trivago.com/wp-content/uploads/2017/11/16101105/eilean-donan-castle-kyle-of-lochalsh-sorin-tudorut-unsplash.jpg"
            }
          ]
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "\"Whisky in Scotland is Like Heat in Australia\"",
      "text": "<p>I settled into the converted cellar, a former prison turned private event space with white walls that extend to the low, curved ceiling. But General Manager, Matthew Logie, has hosted tastings throughout the 15th-century property. Perhaps his greatest success story took place on the second floor where sofas, armchairs, and a modestly-sized bookshelf surround the fireplace. A group of American women signed up while their husbands played golf at the nearby Royal Dornoch golf course, never having taken the drink seriously before. By the end, they were all happy &#8212; and tipsy &#8212; converts.</p><p>Growing up, Matt only knew of whisky through adverts on television. “I had no idea the whisky world was so huge,” he admited. Perhaps that’s because, as Rachel McCormack put it in <em>Chasing the Dram</em>, “whisky in Scotland is like heat in Australia &#8212; it’s everywhere.” It wasn’t until he hit his late teens that he started working in the drinks industry and received a proper education on the topic. But he hardly considered himself an omnipotent source on the matter. “Whisky is a thing that you learn all the time and you can never know everything.”</p>",
      "blocks": [
        {
          "type": "travel_tips_box",
          "title": "When to Visit",
          "tips": [
            {
              "icon": "trivago-icon-icn_thumb_up_line_dark",
              "title": "Whisky in the Winter",
              "description": "<p>Winter is the cheapest time to travel, and since you don’t need good weather for drinking, it’s also a favorite time for whisky travelers.</p>"
            }
          ]
        },
        {
          "type": "single_image_element",
          "image": {
            "title": "map-of-scottish-whisky-styles",
            "alt": "map-of-scottish-whisky-styles",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/29114310/map-of-scottish-whisky-styles.jpg",
            "height": 768,
            "width": 1024,
            "courtesy": "<p>Map of the whisky regions in Scotland.</p>\n"
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "\"Just A Drink\"",
      "text": "<p>To start off the tasting, Matt pulled out a bottle of I Love Dornoch, a blend of Islay peaties from Elixir Distillers in London. Islay, as a novice quickly learns, is an island off the coast of western Scotland and an official whisky region (Speyside, Highlands, Lowlands, Campbeltown are the others) where peat bogs are burned to dry the malted barley, giving the whisky a distinctive smoky flavor and aroma.</p><p>Like wine or any other passion, there will be those who tell you how to do whisky right. “Tears of whisky knowledge” as Phil put it while walking me through their crowd-funded distillery. That is, Scottish people who assume they know about whisky because they’re Scottish.</p><p>Curmudgeonly souls will wince at the thought of drinking a blended Scotch (90 percent of the industry, by the by), insisting that a neat single malt (whisky from a single distillery) is the only way to go. Fortunately, everyone at Dornoch Castle followed the contemporary approach to let people enjoy the whisky however they damn well please. As whisky writer Dave Broom wrote, “Whisky isn’t for an elite, it’s for everyone. It’s a great drink, a fascinating drink, a complex drink, a historical drink but it is, ultimately, JUST A DRINK [emphasis his].”</p>",
      "blocks": [
        {
          "type": "icon_text_box",
          "icon": "trivago-icon-icn_thumb_up_line_dark",
          "title": "More About The Crowd-Funded Dornoch Distillery",
          "message": "<p>The bar at Dornoch Castle laid the foundation for the fledgling Dornoch Distillery. Most Scots starting a distillery would follow a “traditional funding mechanism,” as Phil put it. “Going to the bank, getting shareholders.” But those options didn’t appeal to the Thompson family, especially coming off the banking crisis. “I don’t want to sign my life over to these people, the bank and/or some guy in a suit or a vest. To me, that doesn’t make sense.” Instead, they raised approximately £350,000 by offering future goods and services in the form of casks. A large group of people and local enterprises passionate about whisky came together to make the Dornoch Distillery possible. Casks will be available in approximately 18 months once the spirit reaches the legally required age of three years and one day.</p>",
          "quote": ""
        },
        {
          "type": "single_image_element",
          "image": {
            "title": "dornoch-distillery-dornoch-castle",
            "alt": "dornoch-distillery-dornoch-castle",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/08102851/dornoch-distillery-dornoch-castle.jpg",
            "height": 648,
            "width": 1024,
            "courtesy": "<p>View of the Dornoch Distillery in front of Dornoch Castle. Photo courtesy of Dornoch Castle.</p>\n"
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "The Tasting: \"We Don't Slurp The Whisky Right Back\"",
      "text": "<p>First things first, we studied the bottle. You get the style and the percentage of alcohol (45 in this case), which is important because it clues you in on how much water you’ll be adding later on. Before drinking, “we sniff the whisky in its pure form” and then you take your drink.</p><p>Matt emphasized that “we don’t slurp the whisky right back.” Andy Chu, a young Hongkonger bartender and whisky connoisseur, explained earlier in the day that this collegiate drinking etiquette shocks your brain and blinds your tastebuds. That’s why almost anyone who says they don’t like whisky says so because of a bad night at the bar in their early 20s. Truth be told, there’s likely a whisky out there for you.</p><p>Returning to the freshly-poured dram of I Love Dornoch, we got a campfire aroma, the kind that sticks to your clothes and makes a camp counselor sing “Kumbaya.” Following Matt’s lead, I took a sip, and held it on my palate for a moment.</p><p>“Yeah, that’s really good,” I responded, knowing that this style can be polarizing.</p><p>“It’s a little bit like someone has their favorite wine,” Matt said. “People have their favorite beer, some people have their favorite bourbon, some people love the peatiness of an Islay whisky.”</p>",
      "blocks": [
        {
          "type": "single_image_element",
          "image": {
            "title": "how-to-add-water-to-whisky",
            "alt": "How to add water to whisky",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/08100659/how-to-add-water-to-whisky.jpg",
            "height": 576,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        },
        {
          "type": "paragraph",
          "text": "<p>We moved on to the water. Judging by the percentage of alcohol and the smoothness of the drink (or lack of a burn), you know you don’t need to add much water. But if you do find the peaty flavor too intense, you bring out the dropper &#8212; the same kind you’d use to feed a hamster &#8212; and add three or four drops. This is to avoid adding too much water and diluting the whisky beyond recognition.</p><p>“What the water is doing is dropping the alcohol content in the whisky,” Matt explained. “You will smell it, and you’ll taste it, and you’ll feel that the taste has changed somewhat. Still good. A little bit smoother than it was before. It’s not really got that huge bite in the initial mouthfeel.”</p><p>We were tip-toeing into the linguistic territory that’s alienated me from the wine world with words like “mouthfeel.” This kind of precise judgment leaves me feeling inadequate, like doing push-ups at the gym and looking over to spot Dwayne Johnson holding a small building over his chest. But then I remembered additional wisdom from Andy.</p><p>“We all have the same sense of nosing,” he told me. “I can smell exactly the same thing as you, but it’s about how you express it. It doesn’t mean because I tell you more, I know more.”</p>"
        },
        {
          "type": "single_image_element",
          "image": {
            "title": "i-love-dornoch-whisky",
            "alt": "i-love-dornoch-whisky",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/08100414/i-love-dornoch-whisky.jpg",
            "height": 576,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "Misconceptions",
      "text": "<p>Finished with our dram of I Love Dornoch, Matt pulled up the second of three bottles. “We’re going all the way up to Thurso in Cape Ness,” he said as I took a look at the black and white sketch of a wolf on the label. This was Wolfburn Distillery, which initially closed back in 1877 before reopening in 2013.</p><p>Here, Matt addressed one of the many misconceptions about whisky, that it needs to age for at least five or eight years to be any good. Wolfburn is tangible proof that a young whisky can be pretty damn tasty &#8212; and popular. We were drinking from a cask that was bought and bottled exclusively to celebrate 18 years of the Dornoch Castle Hotel and whisky bar.</p><p>This one clocked in at 51.7 percent alcohol. “What you should be getting is a slight touch of sweetness, and obviously, you smell the wood as well,” said Matt, reminding me of a question that had been burning my notepad: Where does the flavor come from? The wood or the distilling? The amazing thing is that even scientists can’t say definitively, so any answer you get is conjecture from either professional experience or whatever floats your romantic sensibilities. Is it the skilled technique of men and women performing an art that can’t be emulated by assembly line robots, or is it nature flavoring the drink? The answer you’ll get at Dornoch Castle is a resounding “both.”</p><p>“You’ll get your initial spirit taste from the spirit run and that depends on how you distill your spirit,” Matt explained, noting that the Thompson Brothers are using an older method for their fledgling whisky that aims to value quality over quantity. “The spirit yield will be lower, but they get a much purer, old style taste of spirit.”</p>",
      "blocks": [
        {
          "type": "travel_tips_box",
          "title": "When is a Whisky a Whisky?",
          "tips": [
            {
              "icon": "trivago-icon-icn_beach_line_dark",
              "title": "Three Years and One Day",
              "description": "<p>Scottish law says a liquid can’t be called a whisky until it’s been aged in an oak barrel for three years and one day. Expect to find Dornoch Castle Hotel’s whisky in approximately 18 months. (Having tasted the new-make spirit, it promises to be a special affair when the whisky launches.)</p>"
            }
          ]
        },
        {
          "type": "single_image_element",
          "image": {
            "title": "dornoch-castle-wall-of-whisky",
            "alt": "dornoch-castle-wall-of-whisky",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/08100027/dornoch-castle-wall-of-whisky.jpg",
            "height": 576,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        },
        {
          "type": "paragraph",
          "text": "<p>When it comes to the wood flavor, you’re talking about the cask. Scottish distilleries use barrels that used to store port, sherry, bourbon, and wine which undoubtedly infuses the whisky with their own subtle flavor notes.</p><p>“Whisky has the widest range of styles and flavours of any wood-aged spirit. It is versatile. It is for everyone,” wrote Broom. Just as important are the hands and minds behind the operation.</p><p>“Whisky will always need human hands,” said presenter David Hayman in BBC’s <em>Scotch! The Story of Whisky</em>. In an age where some governments are considering a living stipend because so many machines have rendered jobs obsolete, there’s an admitted romanticism to an industry that will always come from human hands. When you consider that in Scotch whisky, it’s often a family affair, as is the case in Dornoch, the narrative becomes that much more powerful, and everyone at the hotel is quick to admit they have one in a million with the brothers Thompsons, their distilling skill, and their ability to spot good whisky.</p>"
        },
        {
          "type": "single_image_element",
          "image": {
            "title": "whisky-tasting-vault",
            "alt": "whisky tasting vault",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24084753/whisky-tasting-vault.jpg",
            "height": 576,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "Pride",
      "text": "<p>Taking a nose and a sip of the Wolfburn, even my novice sensibilities can tell this is no Islay peaty. There’s a sweetness to it, almost like candy, with a hint of caramel. (Hey, ma! Look at me properly dissecting and appreciating my booze!)</p><p>The key to recognizing these aromas and flavors, said Matt, is by reflecting on what you’ve previously smelt or eaten. As you connect different whiskies to the various aromatic and tasting memories of your life, you build a library that connects across your palate and brain that allows you to spot these characteristics in your drink. More importantly, you better savor it. Indeed, there was a sweetness to that first dram of Wolfburn that reminded me just enough of the frosting from a childhood chain’s smiley-faced cookies that I could make a mental note. (Having bought a bottle to bring home, my palate has since detected the sweetness of an apple.)</p><p>Since the Wolfburn does have high alcohol content, we brought the water in to eliminate the burn and make some of the flavors more noticeable. Like blended whiskies, you’ll come across drinkers who swear against adding any water to their whisky and will make you feel bad for even thinking it. “Pride is a lot of it,” says Matt, noting most people drink their whisky like their father did. “My dad does nothing wrong and my grandfather did it like that before him, so this must be the right way of doing it!”</p><p>Once you get over that nonsensical hill, you realize adding drops of water changes the whisky, and for some drinkers, makes it more palatable and enjoyable. With the Wolfburn, the sweetness intensifies without being overbearing and that alcohol burn is all but gone.</p>",
      "blocks": [
        {
          "type": "single_image_element",
          "image": {
            "title": "whisky-tasting-dornoch-castle",
            "alt": "whisky-tasting-dornoch-castle",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/08095810/whisky-tasting-dornoch-castle.jpg",
            "height": 576,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "Success",
      "text": "<p>Wrapping up the tasting, Matt placed a Highland Park aged 15 years from the Orkney Islands on the table. If you know anything about your whisky, this is some of the good stuff. The specific bottle we were drinking came from an oak sherry cask and was bottled by the Independent Whisky Bars of Scotland, which consists of just five bars. The whisky bar at Dornoch Castle Hotel is one of them.</p><p>I took a nose of the 58.1 percent proof dram and Matt encouraged me to give him my own notes.</p><p>“Something a little bit like caramel?” I hesitated.</p><p>“Exactly,” he confirmed. “You’re getting the sweetness from the sherry.”</p><p>Success.</p>",
      "blocks": "",
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "\"Absolutely Vital\"",
      "text": "<p>The tasting completed, I sat with a dram of peaty Laphroaig 10 in the dimly-lit dining room shared with the bar and a roaring wood fire in front of me. I reflected on the tasting itself, the people I met over my three days at Dornoch Castle, and the prevailing question that had been on my mind throughout my travels. How connected is whisky to Scottish culture? How important is it?</p><p>“Massive,” “Huge,” “Absolutely vital” are some of the short answers I was given. Hotelier Colin Thompson (Phil’s father) expanded on his two cents, adding, “Everywhere you go in the world, first of all, you’ll meet a Scotsman, and secondly, you’ll find a bottle of malt in a bar somewhere.”</p>",
      "blocks": [
        {
          "type": "single_image_element",
          "image": {
            "title": "dornoch-castle-dram",
            "alt": "dornoch-castle-dram",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/08095253/dornoch-castle-dram.jpg",
            "height": 644,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        },
        {
          "type": "paragraph",
          "text": "<p>The link between whisky and Scotland has morphed into legend with tales dating back to the time of poet Robert Burns who said in 1786 that “the ruddy complexion and strength of these people is not owing to water-drinking, but to the aquae vitae.” Burns also gets credit for pushing whisky as a key ingredient to a well-rounded diet, writing in his poem “Scottish Drink” that whisky drinking leads to good health. (He also prescribed a dram or two to cure writer&#8217;s’ block, which is a claim I’ve since blindly accepted.)</p><p>Mythology aside, whisky was used as a painkiller throughout the history of the United States, Canada, and across the United Kingdom. Author Fred Minnick of <em>Whiskey Women</em> wrote, “Whiskey was a woman’s weapon in the battle against sickness and death,” specifically depression and tuberculosis. “For pneumonia, a housewife would administer whiskey with milk and eggs every two hours.” And if you were suffering from “inflammation of the bowels,” The Female’s Friend from 1837 recommended a glass of whisky.</p><p>Even just economically speaking, whisky, as Matt noted during our tasting, is the engine that keeps Scotland running. It’s the third largest industry behind oil and technology with, as of 2018, 118 working distilleries and an additional 30 starting up across Scotland. Exports pull in approximately £125 every second and the industry directly employs over 10,000 people with 120,000 jobs throughout the United Kingdom connected to whisky production and export &#8212; roughly 7,000 of which are in rural regions where employment is scarce. <em>Chasing the Dram’s</em> Rachel McCormack puts it more succinctly.</p><p>“Everyone in Scotland has some connection with whisky, even if they think they don’t.”</p>"
        },
        {
          "type": "single_image_element",
          "image": {
            "title": "whisky-bar-dornoch-castle",
            "alt": "whisky bar dornoch castle",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24074433/whisky-bar-dornoch-castle.jpg",
            "height": 576,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "text_module",
      "title": "Pilgrimage",
      "text": "<p>Most who will stay and drink at Dornoch Castle will be on a pilgrimage of sorts, traveling along the Scottish Malt Whisky Trail to visit nearby Highland distilleries like Glen Morangie, Balblair, and Ardmore. Thanks to their bar, winner of Whiskybase’s Scottish Whisky Bar of the year in 2014 and 2016, Dornoch Castle has become a defacto stop along the trail without a drop of the pretension that usually comes with such accolades.</p><p>Matt admitted without a flinch to having a dram of Johnnie Walker Red Label (a mass-produced blend) with a splash of coke when sitting at home in front of the fire. Phil fondly recalled his father taking his whisky with a couple of cubes of ice, which might make a pompous purveyor of whisky weep if he weren’t so worried about getting water in his drink.</p><p>“There’s not a right or wrong in the whisky world,” Matt reminded us. “A lot of people think there is, that you&#8217;ve got to drink whisky one way, you’ve got to add two drops of water, swirl it around anti-clockwise three times. It’s not the case. Whisky is to be enjoyed and there’s so many out there that there’s a whisky for everyone and there’s a way of drinking it and you just find the way that you enjoy it.”</p>",
      "blocks": [
        {
          "type": "single_image_element",
          "image": {
            "title": "dornoch-castle-bar",
            "alt": "dornoch-castle-bar",
            "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/08094548/dornoch-castle-bar.jpg",
            "height": 576,
            "width": 1024,
            "courtesy": ""
          },
          "alignment": "horizontal",
          "comments": "Implement 4:3 Ratio"
        },
        {
          "type": "paragraph",
          "text": "<p>And considering the booming growth of whisky’s popularity, there’s someone to drink it with, which if you ask anyone who knows what they’re talking about it, that’s the whole point. “It’s about loosening tongues and bringing people together,” noted Broom in <em>Scotch!</em>. The folks behind Dornoch Castle shared that sentiment.</p><p>“For me, it’s about the company,” said Colin. “I want to drink with someone and have the conversation about it.” Andy, in a separate conversation, agreed.</p><p>“With tasting whisky, we’re not just tasting on our own,” said Andy. You want to share, you want to have fun as well. Same with me. I want to drink whisky with you. I don’t want to drink whisky by myself. Otherwise it’s called getting drunk.”</p>"
        }
      ],
      "enabled_read_more_for_blocks": false,
      "hotel_modules": ""
    },
    {
      "type": "hotel_module",
      "title": "Dornoch Castle Hotel: All You Need To Know",
      "gallery": [
        {
          "title": "Dornoch Castle Hotel",
          "alt": "dornoch castle room 3",
          "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24112538/dornoch-castle-room-3.jpg",
          "height": 684,
          "width": 1024,
          "courtesy": "<p>Image courtesy of Dornoch Castle</p>\n"
        },
        {
          "title": "dornoch-castle-outside",
          "alt": "dornoch-castle-outside",
          "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24094630/dornoch-castle-outside.jpg",
          "height": 576,
          "width": 1024,
          "courtesy": ""
        },
        {
          "title": "dornoch-castle-room-2",
          "alt": "dornoch castle room 2",
          "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24112537/dornoch-castle-room-2.jpg",
          "height": 711,
          "width": 1024,
          "courtesy": "<p>Image courtesy of Dornoch Castle</p>\n"
        },
        {
          "title": "dornoch-castle-room-1",
          "alt": "dornoch-castle-room-1",
          "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24112537/dornoch-castle-room-1.jpg",
          "height": 683,
          "width": 1024,
          "courtesy": "<p>Image courtesy of Dornoch Castle</p>\n"
        }
      ],
      "hotel": {
        "type": "hotel",
        "id": 1758325,
        "name": "Dornoch Castle",
        "ratingValue": 80.97,
        "ratingCount": 333,
        "ratingText": "Very good",
        "category": 3,
        "url": "https://api.trivago.com/webservice/tas/forward.php?enc=_.iif6CFYzD9b1Jyy11KD-WsHp8ixitueYyQ8PbwGe.GgEaR7QtFApyVCyWTyKOHCOQ9J.14-Y6VxZeYBEIk6wqIOdNOaFWA38U00gylAYxjR8syN91TOngcSHwS6CzyNeMxKO7xi3oPFNs0IzofYEaKTyC7Zx97yNg",
        "amenities": [],
        "tags": [
          {
            "tag_id": "25",
            "tag_name": "Parking garage",
            "icon": "parking"
          },
          {
            "tag_id": "47",
            "tag_name": "Restaurant",
            "icon": "restaurant"
          },
          {
            "tag_id": "31",
            "tag_name": "Hotel bar",
            "icon": "bar"
          },
          {
            "tag_id": "62",
            "tag_name": "WiFi in lobby",
            "icon": "wifi"
          }
        ],
        "rating_aspects": {
          "aspect_type": "location",
          "aspect_name": "Location",
          "aspect_rating_percentage": 91,
          "aspect_text": "Excellent",
          "aspect_index": 5
        },
        "distance": [],
        "homePageURL": "https://www.trivago.com/dornoch-41772/hotel/dornoch-castle-1758325",
        "show_extra_hotel_info": true
      },
      "blocks": [
        {
          "type": "description",
          "first": true,
          "text": "<p><a href=\"https://www.trivago.com/dornoch-41772/hotel/dornoch-castle-1758325\" target=\"_blank\" rel=\"noopener\"><strong>Dornoch Castle</strong></a> is located in the Scottish Highlands near the center of the village of Dornoch. American golfers make up the majority of their summer travelers, sitting conveniently next to the Royal Dornoch golf course, but the property proves just as popular for travelers following the whisky trail and outdoor enthusiasts who want to experience the best of Scottish scenery.</p><p>Dornoch Castle boasts 22 en-suite bedrooms &#8212; eight standard, eight superior, two deluxe, three family rooms, and a single. Oak paneling adorns Elizabethan-style, hand-carved four-poster beds with the original stone walls adding the final historic touches. Guests can enjoy fine dining in The Vault featuring a menu of Scottish cuisine cooked up by head chef Grant MacNicol, who takes advantage of the whisky knowledge on-site to infuse the amber liquid into his cooking. Expect to find peaty whisky barbecue glaze and recommended whisky pairings to match your food.</p>"
        }
      ],
      "enabled_read_more_for_blocks": true
    },
    {
      "type": "table_of_contents",
      "show": true,
      "header": "Skip to the hotel",
      "table_of_contents": {
        "10": {
          "hotel_module": {
            "type": "hotel",
            "id": 1758325,
            "name": "Dornoch Castle",
            "ratingValue": 80.97,
            "ratingCount": 333,
            "ratingText": "Very good",
            "category": 3,
            "url": "https://api.trivago.com/webservice/tas/forward.php?enc=_.iif6CFYzD9b1Jyy11KD-WsHp8ixitueYyQ8PbwGe.GgEaR7QtFApyVCyWTyKOHCOQ9J.14-Y6VxZeYBEIk6wqIOdNOaFWA38U00gylAYxjR8syN91TOngcSHwS6CzyNeMxKO7xi3oPFNs0IzofYEaKTyC7Zx97yNg",
            "amenities": [],
            "tags": [
              {
                "tag_id": "25",
                "tag_name": "Parking garage",
                "icon": "parking"
              },
              {
                "tag_id": "47",
                "tag_name": "Restaurant",
                "icon": "restaurant"
              },
              {
                "tag_id": "31",
                "tag_name": "Hotel bar",
                "icon": "bar"
              },
              {
                "tag_id": "62",
                "tag_name": "WiFi in lobby",
                "icon": "wifi"
              }
            ],
            "rating_aspects": {
              "aspect_type": "location",
              "aspect_name": "Location",
              "aspect_rating_percentage": 91,
              "aspect_text": "Excellent",
              "aspect_index": 5
            },
            "distance": [],
            "homePageURL": "https://www.trivago.com/dornoch-41772/hotel/dornoch-castle-1758325",
            "show_extra_hotel_info": true,
            "title": "Dornoch Castle Hotel: All You Need To Know"
          }
        }
      }
    },
    {
      "type": "footnote",
      "text": "<p><strong>A portion of video music courtesy of <a href=\"https://thefiddlerevolt.com/\" target=\"_blank\" rel=\"noopener\">The Fiddle Revolt</a>, &#8220;Hey Wait.&#8221;</strong></p>\n"
    },
    {
      "type": "courtesy_list",
      "show_courtesy_list": false,
      "courtesy_list_title": "",
      "courtesy_list_contents": {
        "0": {
          "title": "Dornoch Castle Hotel",
          "alt": "dornoch castle room 3",
          "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24112538/dornoch-castle-room-3.jpg",
          "height": 684,
          "width": 1024,
          "courtesy": "<p>Image courtesy of Dornoch Castle</p>\n"
        },
        "2": {
          "title": "dornoch-castle-room-2",
          "alt": "dornoch castle room 2",
          "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24112537/dornoch-castle-room-2.jpg",
          "height": 711,
          "width": 1024,
          "courtesy": "<p>Image courtesy of Dornoch Castle</p>\n"
        },
        "3": {
          "title": "dornoch-castle-room-1",
          "alt": "dornoch-castle-room-1",
          "url": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/24112537/dornoch-castle-room-1.jpg",
          "height": 683,
          "width": 1024,
          "courtesy": "<p>Image courtesy of Dornoch Castle</p>\n"
        }
      }
    }
  ],
  "post_meta": {
    "template": "posts-templates/performance",
    "im_city": "",
    "im_state": "",
    "im_country": ""
  },
  "author": {
    "name": "Joe Baur",
    "slug": "jbaur",
    "image": "https://media-magazine.trivago.com/wp-content/uploads/2018/07/17100853/joe-baur-travel-headshot.jpg",
    "social_networks": {
      "facebook": "http://facebook.com/BaurJoe",
      "twitter": "http://twitter.com/BaurJoe",
      "instagram": "http://instagram.com/BaurJoe",
      "googleplus": "",
      "pinterest": "http://pinterest.com/BaurJoe"
    }
  },
  "seo_href": [],
  "seo_meta": {
    "title": "Dornoch Castle: A Whisky Tasting at One of the World's Most Popular Hotel Bars",
    "metadesc": "Dornoch Castle has amassed a whisky collection unlike most any other in the world. trivago Magazine Editor, Joe Baur, signs up for their whisky tasting.",
    "metakeywords": "",
    "focuskw": "dornoch castle",
    "linkdex": "53",
    "canonical": "https://magazine.trivago.com/dornoch-castle-scotland-whisky/",
    "redirect": "",
    "meta_robots_noindex": "",
    "meta_robots_nofollow": "",
    "meta_robots_adv": "",
    "opengraph_site_name": "trivago Magazine",
    "opengraph_locale": "en_US",
    "opengraph_type": "website",
    "opengraph_description": "Dornoch Castle has amassed a whisky collection unlike most any other in the world. trivago Magazine Editor, Joe Baur, signs up for their whisky tasting. Video below.",
    "opengraph_url": "https://magazine.trivago.com/dornoch-castle-scotland-whisky/",
    "opengraph_image": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/23144800/dornoch-castle-whisky-bar.jpg",
    "opengraph_title": "Dornoch Castle: A Whisky Tasting at One of the World's Most Popular Hotel Bars",
    "twitter_title": "Dornoch Castle: A Whisky Tasting at One of the World's Most Popular Hotel Bars",
    "twitter_description": "",
    "twitter_image": "https://media-magazine.trivago.com/wp-content/uploads/2019/01/23144800/dornoch-castle-whisky-bar.jpg"
  },
  "words_count": 0
}